; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f20-c8-s4-i8-g2-r2025-010-110-210-310
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10
 - card
          celln0 celln1 celln2 celln3 celln4 celln5 celln6 celln7 celln8 celln9 celln10 celln11 celln12 celln13 celln14 celln15 celln16 celln17 celln18 celln19 celln20 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(cellsuccessor celln5 celln4)
(cellsuccessor celln6 celln5)
(cellsuccessor celln7 celln6)
(cellsuccessor celln8 celln7)
(cellsuccessor celln9 celln8)
(cellsuccessor celln10 celln9)
(cellsuccessor celln11 celln10)
(cellsuccessor celln12 celln11)
(cellsuccessor celln13 celln12)
(cellsuccessor celln14 celln13)
(cellsuccessor celln15 celln14)
(cellsuccessor celln16 celln15)
(cellsuccessor celln17 celln16)
(cellsuccessor celln18 celln17)
(cellsuccessor celln19 celln18)
(cellsuccessor celln20 celln19)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln20)
(colspace coln0)

(bottomcol c1)
(on s3 c1)
(on d3 s3)
(on s9 d3)
(clear s9)

(bottomcol s8)
(on d4 s8)
(on s6 d4)
(clear s6)

(bottomcol d7)
(on c9 d7)
(on h4 c9)
(on d8 h4)
(on d2 d8)
(on c7 d2)
(on c5 c7)
(on h6 c5)
(on d1 h6)
(clear d1)

(bottomcol d6)
(on c10 d6)
(on s10 c10)
(on c2 s10)
(on h5 c2)
(on h3 h5)
(clear h3)

(bottomcol s2)
(on c6 s2)
(on h1 c6)
(on h8 h1)
(on c4 h8)
(clear c4)

(bottomcol s1)
(on s4 s1)
(on d9 s4)
(clear d9)

(bottomcol h7)
(on s7 h7)
(on c8 s7)
(on d10 c8)
(clear d10)

(bottomcol h9)
(on d5 h9)
(on h2 d5)
(on h10 h2)
(on c3 h10)
(on s5 c3)
(clear s5)
)
(:goal
(and
(home c2)
(home h2)
(home s2)
(home d2)
)
)
)

; plan
1. (sendtohome d1 h6 d n1 d0 n0)
   deleted: (on d1 h6) (home d0) (clear d1)
   added: (home d1) (clear h6)
   goals met: 0 of 4
2. (sendtofree d9 s4 celln20 celln19)
   deleted: (on d9 s4) (clear d9) (cellspace celln20)
   added: (incell d9) (clear s4) (cellspace celln19)
   goals met: 0 of 4
3. (sendtofree s4 s1 celln19 celln18)
   deleted: (on s4 s1) (clear s4) (cellspace celln19)
   added: (incell s4) (clear s1) (cellspace celln18)
   goals met: 0 of 4
4. (sendtohome-b s1 s n1 s0 n0 coln0 coln1)
   deleted: (home s0) (clear s1) (bottomcol s1) (colspace coln0)
   added: (home s1) (colspace coln1)
   goals met: 0 of 4
5. (sendtofree s9 d3 celln18 celln17)
   deleted: (on s9 d3) (clear s9) (cellspace celln18)
   added: (incell s9) (clear d3) (cellspace celln17)
   goals met: 0 of 4
6. (sendtofree c4 h8 celln17 celln16)
   deleted: (on c4 h8) (clear c4) (cellspace celln17)
   added: (incell c4) (clear h8) (cellspace celln16)
   goals met: 0 of 4
7. (sendtofree h8 h1 celln16 celln15)
   deleted: (on h8 h1) (clear h8) (cellspace celln16)
   added: (incell h8) (clear h1) (cellspace celln15)
   goals met: 0 of 4
8. (sendtohome h1 c6 h n1 h0 n0)
   deleted: (on h1 c6) (home h0) (clear h1)
   added: (home h1) (clear c6)
   goals met: 0 of 4
9. (sendtofree h6 c5 celln15 celln14)
   deleted: (on h6 c5) (clear h6) (cellspace celln15)
   added: (incell h6) (clear c5) (cellspace celln14)
   goals met: 0 of 4
10. (sendtofree c5 c7 celln14 celln13)
   deleted: (on c5 c7) (clear c5) (cellspace celln14)
   added: (incell c5) (clear c7) (cellspace celln13)
   goals met: 0 of 4
11. (sendtofree c7 d2 celln13 celln12)
   deleted: (on c7 d2) (clear c7) (cellspace celln13)
   added: (incell c7) (clear d2) (cellspace celln12)
   goals met: 0 of 4
12. (sendtohome d2 d8 d n2 d1 n1)
   deleted: (on d2 d8) (home d1) (clear d2)
   added: (home d2) (clear d8)
   goals met: 1 of 4
13. (sendtofree s5 c3 celln12 celln11)
   deleted: (on s5 c3) (clear s5) (cellspace celln12)
   added: (incell s5) (clear c3) (cellspace celln11)
   goals met: 1 of 4
14. (sendtofree c3 h10 celln11 celln10)
   deleted: (on c3 h10) (clear c3) (cellspace celln11)
   added: (incell c3) (clear h10) (cellspace celln10)
   goals met: 1 of 4
15. (sendtofree h10 h2 celln10 celln9)
   deleted: (on h10 h2) (clear h10) (cellspace celln10)
   added: (incell h10) (clear h2) (cellspace celln9)
   goals met: 1 of 4
16. (sendtohome h2 d5 h n2 h1 n1)
   deleted: (on h2 d5) (home h1) (clear h2)
   added: (home h2) (clear d5)
   goals met: 2 of 4
17. (sendtofree c6 s2 celln9 celln8)
   deleted: (on c6 s2) (clear c6) (cellspace celln9)
   added: (incell c6) (clear s2) (cellspace celln8)
   goals met: 2 of 4
18. (sendtohome-b s2 s n2 s1 n1 coln1 coln2)
   deleted: (home s1) (clear s2) (bottomcol s2) (colspace coln1)
   added: (home s2) (colspace coln2)
   goals met: 3 of 4
19. (sendtofree h3 h5 celln8 celln7)
   deleted: (on h3 h5) (clear h3) (cellspace celln8)
   added: (incell h3) (clear h5) (cellspace celln7)
   goals met: 3 of 4
20. (sendtofree h5 c2 celln7 celln6)
   deleted: (on h5 c2) (clear h5) (cellspace celln7)
   added: (incell h5) (clear c2) (cellspace celln6)
   goals met: 3 of 4
21. (sendtofree d3 s3 celln6 celln5)
   deleted: (on d3 s3) (clear d3) (cellspace celln6)
   added: (incell d3) (clear s3) (cellspace celln5)
   goals met: 3 of 4
22. (sendtofree s3 c1 celln5 celln4)
   deleted: (on s3 c1) (clear s3) (cellspace celln5)
   added: (incell s3) (clear c1) (cellspace celln4)
   goals met: 3 of 4
23. (sendtohome-b c1 c n1 c0 n0 coln2 coln3)
   deleted: (home c0) (clear c1) (bottomcol c1) (colspace coln2)
   added: (home c1) (colspace coln3)
   goals met: 3 of 4
24. (sendtohome c2 s10 c n2 c1 n1)
   deleted: (on c2 s10) (home c1) (clear c2)
   added: (home c2) (clear s10)
   goals met: 4 of 4
